#############################################################
# ~/.Brewfile - Software Installs for MacOS                 #
#                                                           #
# List of packages to be installed / updated via Homebrew   #
# Apps are sorted by category, and arranged alphabetically  #
# Be sure to delete / comment out anything you do not need  #
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile #
# Source GH repository: https://github.com/lissy93/Brewfile #
# See brew docs for more info: https://docs.brew.sh/Manpage #
#                                                           #
# License: MIT © Alicia Sykes 2022 <https://aliciasykes.com>#
#############################################################

# Options
cask_args appdir: '~/Applications', require_sha: true

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"


# Brew
brew "asciinema"
brew "bat"
brew "bun"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-absorb"
brew "helix"
brew "ipcalc"
brew "jj"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "llm"
brew "mas"
brew "mise"
brew "neovim"
brew "pandoc"
brew "pearcleaner"
brew "pipx"
brew "pnpm"
brew "ripgrep"
brew "sqlite"
brew "starship"
brew "stow"
brew "superfile"
brew "unar"
brew "uv"
brew "wget"
brew "yadm"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew 'gemini-cli'

# Cask
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "arc"
cask "claude"
cask "discord"
cask "font-blex-mono-nerd-font"
cask "font-ia-writer-mono"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "iterm2"
cask "karabiner-elements"
cask "keymapp"
cask "leader-key"
cask "localsend"
cask "macwhisper"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-teams", greedy: true
cask "microsoft-word", greedy: true
cask "neovide-app"
cask "obsidian", greedy: true
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "spotify"
cask "syntax-highlight"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "voiceink"
cask "zed"
cask "zoom"

# Mas
mas '1Password for Safari', id: 1569813296
mas "Drafts", id: 1435957248
mas 'OpenIn', id: 1643649331
mas "Simplenote", id: 692867256
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
mas "obsidian-web-clipper",id: 6720708363
mas "pl2303-serial",id: 1624835354
mas "raycast-companion",id: 6738274497
mas "zsa-keymapp",id: 6472865291
